namespace Task_02_04
{
    internal class Program
    {
        static void Main(string[] args)
        {
            /*
             Пользователь вводит свою дату рождения построчно (сначала год, потом месяц и в конце дату) произведите
расчет является ли пользователь совершеннолетним на текущую дату и выведите соответствующее сообщение об
этом
             */
            Console.WriteLine("Введите текущий год: ");
            int user;
            user = int.Parse(Console.ReadLine());
            Console.WriteLine("Введите сегодняшний месяц: ");

            int user1;
            user1 = int.Parse(Console.ReadLine());

            Console.WriteLine("Введите сегодняшнее число: ");
            int user2;
            user2 = int.Parse(Console.ReadLine());


            
        }
    }
}
